# Minard

In [1]:
from datascience import *

In [2]:
minard = Table.read_table('../data/minard.csv')

In [3]:
minard

Longitude | Latitude | City        | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000
34.3      | 55.2     | Wixma       | Retreat   | 55000
32        | 54.6     | Smolensk    | Retreat   | 24000
30.4      | 54.4     | Orscha      | Retreat   | 20000
26.8      | 54.3     | Moiodexno   | Retreat   | 12000

In [4]:
minard.num_columns, minard.num_rows, minard.labels

(5, 8, ('Longitude', 'Latitude', 'City', 'Direction', 'Survivors'))

In [5]:
minard.column('Survivors')

array([145000, 140000, 127100, 100000,  55000,  24000,  20000,  12000])

In [6]:
minard.column('Survivors')[0], minard.column('Survivors').item(0)

(145000, 145000)

In [7]:
initial_size = minard.column('Survivors').item(0)
initial_size

145000

In [8]:
percentage_surviving = minard.column('Survivors') / initial_size
percentage_surviving

array([1.        , 0.96551724, 0.87655172, 0.68965517, 0.37931034,
       0.16551724, 0.13793103, 0.08275862])

In [9]:
minard_ext = minard.with_column('Percent surviving', percentage_surviving)
minard_ext.set_format('Percent surviving', PercentFormatter)
minard_ext

Longitude | Latitude | City        | Direction | Survivors | Percent surviving
32        | 54.8     | Smolensk    | Advance   | 145000    | 100.00%
33.2      | 54.9     | Dorogobouge | Advance   | 140000    | 96.55%
34.4      | 55.5     | Chjat       | Advance   | 127100    | 87.66%
37.6      | 55.8     | Moscou      | Advance   | 100000    | 68.97%
34.3      | 55.2     | Wixma       | Retreat   | 55000     | 37.93%
32        | 54.6     | Smolensk    | Retreat   | 24000     | 16.55%
30.4      | 54.4     | Orscha      | Retreat   | 20000     | 13.79%
26.8      | 54.3     | Moiodexno   | Retreat   | 12000     | 8.28%

# List

In [10]:
flowers = Table.read_table('../data/flowers.csv')
flowers

Petals | Name      | Color
8      | lotus     | pink
34     | sunflower | yellow
5      | rose      | red

In [11]:
a_flower = [5, 'morning glory', 'purple']
flowers.with_row(a_flower)

Petals | Name          | Color
8      | lotus         | pink
34     | sunflower     | yellow
5      | rose          | red
5      | morning glory | purple

# Take

In [12]:
flowers.select('Name')

Name
lotus
sunflower
rose

In [13]:
flowers.take((1, 0))

Petals | Name      | Color
34     | sunflower | yellow
8      | lotus     | pink

In [14]:
import numpy as np

In [15]:
minard.take(np.arange(0, 4))

Longitude | Latitude | City        | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000

In [16]:
flowers

Petals | Name      | Color
8      | lotus     | pink
34     | sunflower | yellow
5      | rose      | red

# Where

In [17]:
nba = Table.read_table('../data/nba_salaries.csv')
nba

PLAYER           | POSITION | TEAM          | 2015-2016 SALARY
Paul Millsap     | PF       | Atlanta Hawks | 18.6717
Al Horford       | C        | Atlanta Hawks | 12
Tiago Splitter   | C        | Atlanta Hawks | 9.75625
Jeff Teague      | PG       | Atlanta Hawks | 8
Kyle Korver      | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha  | SF       | Atlanta Hawks | 4
Mike Scott       | PF       | Atlanta Hawks | 3.33333
Kent Bazemore    | SF       | Atlanta Hawks | 2
Dennis Schroder  | PG       | Atlanta Hawks | 1.7634
Tim Hardaway Jr. | SG       | Atlanta Hawks | 1.30452
... (407 rows omitted)

In [18]:
nba.sort('2015-2016 SALARY', descending=True)

PLAYER          | POSITION | TEAM                  | 2015-2016 SALARY
Kobe Bryant     | SF       | Los Angeles Lakers    | 25
Joe Johnson     | SF       | Brooklyn Nets         | 24.8949
LeBron James    | SF       | Cleveland Cavaliers   | 22.9705
Carmelo Anthony | SF       | New York Knicks       | 22.875
Dwight Howard   | C        | Houston Rockets       | 22.3594
Chris Bosh      | PF       | Miami Heat            | 22.1927
Chris Paul      | PG       | Los Angeles Clippers  | 21.4687
Kevin Durant    | SF       | Oklahoma City Thunder | 20.1586
Derrick Rose    | PG       | Chicago Bulls         | 20.0931
Dwyane Wade     | SG       | Miami Heat            | 20
... (407 rows omitted)

In [19]:
nba = nba.relabeled('2015-2016 SALARY', 'SALARY')

In [20]:
nba.where('SALARY', are.above(10))

PLAYER         | POSITION | TEAM              | SALARY
Paul Millsap   | PF       | Atlanta Hawks     | 18.6717
Al Horford     | C        | Atlanta Hawks     | 12
Joe Johnson    | SF       | Brooklyn Nets     | 24.8949
Thaddeus Young | PF       | Brooklyn Nets     | 11.236
Al Jefferson   | C        | Charlotte Hornets | 13.5
Nicolas Batum  | SG       | Charlotte Hornets | 13.1253
Kemba Walker   | PG       | Charlotte Hornets | 12
Derrick Rose   | PG       | Chicago Bulls     | 20.0931
Jimmy Butler   | SG       | Chicago Bulls     | 16.4075
Joakim Noah    | C        | Chicago Bulls     | 13.4
... (59 rows omitted)

In [21]:
nba.where('SALARY', are.between(10, 11))

PLAYER          | POSITION | TEAM                 | SALARY
Brendan Haywood | C        | Cleveland Cavaliers  | 10.5225
Wilson Chandler | SF       | Denver Nuggets       | 10.4494
Monta Ellis     | SG       | Indiana Pacers       | 10.3
Luol Deng       | SF       | Miami Heat           | 10.1516
Tyreke Evans    | SG       | New Orleans Pelicans | 10.7346
Jrue Holiday    | PG       | New Orleans Pelicans | 10.5955
Gerald Wallace  | SF       | Philadelphia 76ers   | 10.1059
Danny Green     | SG       | San Antonio Spurs    | 10
DeMar DeRozan   | SG       | Toronto Raptors      | 10.05

In [22]:
nba.where('TEAM', are.equal_to('Toronto Raptors'))

PLAYER            | POSITION | TEAM            | SALARY
DeMarre Carroll   | SF       | Toronto Raptors | 13.6
Kyle Lowry        | PG       | Toronto Raptors | 12
DeMar DeRozan     | SG       | Toronto Raptors | 10.05
Cory Joseph       | PG       | Toronto Raptors | 7
Patrick Patterson | PF       | Toronto Raptors | 6.26867
Jonas Valanciunas | C        | Toronto Raptors | 4.66048
Terrence Ross     | SF       | Toronto Raptors | 3.55392
Luis Scola        | PF       | Toronto Raptors | 2.9
Bismack Biyombo   | C        | Toronto Raptors | 2.814
Luke Ridnour      | PG       | Toronto Raptors | 2.75
... (7 rows omitted)

In [23]:
nba.where('TEAM', 'Toronto Raptors')

PLAYER            | POSITION | TEAM            | SALARY
DeMarre Carroll   | SF       | Toronto Raptors | 13.6
Kyle Lowry        | PG       | Toronto Raptors | 12
DeMar DeRozan     | SG       | Toronto Raptors | 10.05
Cory Joseph       | PG       | Toronto Raptors | 7
Patrick Patterson | PF       | Toronto Raptors | 6.26867
Jonas Valanciunas | C        | Toronto Raptors | 4.66048
Terrence Ross     | SF       | Toronto Raptors | 3.55392
Luis Scola        | PF       | Toronto Raptors | 2.9
Bismack Biyombo   | C        | Toronto Raptors | 2.814
Luke Ridnour      | PG       | Toronto Raptors | 2.75
... (7 rows omitted)

In [24]:
nba.where('PLAYER', are.containing('all'))

PLAYER            | POSITION | TEAM               | SALARY
Danilo Gallinari  | SF       | Denver Nuggets     | 14
Langston Galloway | SG       | New York Knicks    | 0.845059
Gerald Wallace    | SF       | Philadelphia 76ers | 10.1059
Kendall Marshall  | PG       | Philadelphia 76ers | 2.14477
Ray McCallum      | PG       | San Antonio Spurs  | 0.947276
John Wall         | PG       | Washington Wizards | 15.852

# Lab

In [25]:
you = 'keep'
this = 'book'
a = 'beeper'
the = a.replace('p', you) 
print('the:', the)
the.replace('bee', this)

the: beekeeper

'bookkeeper'

In [26]:
founded = 'BC 753'
sacked = 'AD 410'
start = int(founded.replace('BC ', '-'))
end = int(sacked.replace('AD ', ''))
print('Ancient Rome lasted for about', end-start, 'years from', founded, 'to', sacked)

Ancient Rome lasted for about 1163 years from BC 753 to AD 410

A  π/4 -radian (45-degree) angle forms a right triangle with equal base and height. If the hypotenuse (the radius of the circle in the picture) is 1, then the height is sin(π/4). Compute that using sin and pi from the math module. Give the result the name sine_of_pi_over_four.

In [27]:
import math
sine_of_pi_over_four = math.sin(math.pi / 4)
sine_of_pi_over_four

0.7071067811865476

In [28]:
# import IPython.display
# art = IPython.display.Image(url='https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/David_-_The_Death_of_Socrates.jpg/1024px-David_-_The_Death_of_Socrates.jpg')
# art

In [29]:
# use np.arange to create an array with the multiples of 99 from 0 up to (and including) 9999
import numpy as np
np.arange(0, 10000, 99)

array([   0,   99,  198,  297,  396,  495,  594,  693,  792,  891,  990,
       1089, 1188, 1287, 1386, 1485, 1584, 1683, 1782, 1881, 1980, 2079,
       2178, 2277, 2376, 2475, 2574, 2673, 2772, 2871, 2970, 3069, 3168,
       3267, 3366, 3465, 3564, 3663, 3762, 3861, 3960, 4059, 4158, 4257,
       4356, 4455, 4554, 4653, 4752, 4851, 4950, 5049, 5148, 5247, 5346,
       5445, 5544, 5643, 5742, 5841, 5940, 6039, 6138, 6237, 6336, 6435,
       6534, 6633, 6732, 6831, 6930, 7029, 7128, 7227, 7326, 7425, 7524,
       7623, 7722, 7821, 7920, 8019, 8118, 8217, 8316, 8415, 8514, 8613,
       8712, 8811, 8910, 9009, 9108, 9207, 9306, 9405, 9504, 9603, 9702,
       9801, 9900, 9999])

In [30]:
# Create an array of the time, in seconds, since the start of December at which each hourly reading was taken
collection_times = np.arange(0, 31 * 24 * 60 * 60, 60 * 60)
len(collection_times), 31 * 24

(744, 744)

In [31]:
#  Use np.arange and the exponentiation operator ** to compute the first 15 powers of 2, starting from 2^0
powers_of_2 = 2 ** np.arange(0, 15)
powers_of_2

array([    1,     2,     4,     8,    16,    32,    64,   128,   256,
         512,  1024,  2048,  4096,  8192, 16384], dtype=int32)

In [32]:
# we initially invest 10.23 dollars, one year later our total money is 14.32 dollars. What was our annual growth rate?
annual_growth_rate = (14.32 - 10.23) / 10.23
annual_growth_rate

0.3998044965786901

In [33]:
initials = make_array(10.21, 11.32, 15.21, 13.22, 19.10)
changed = make_array(14.20, 35.44, 10.43, 9.62, 20.10)
annual_growth_rates = (changed - initials) / initials
annual_growth_rates

array([ 0.39079334,  2.13074205, -0.31426693, -0.27231467,  0.05235602])

In [34]:
 # growth rate is: (after/before) ** (1/t) - 1
(50.32 / 10) ** (1/10) - 1

0.17536854288914272

In [35]:
# everyone initially started with 10 dollars, calculate the annual growth rate per person over 10 years 
ten_years = make_array(50.32, 1.04, 0.40, 14.50, 11.12)
annual_rates_over_ten_years = (ten_years / 10) ** (1/10) - 1
annual_rates_over_ten_years

array([ 0.17536854, -0.20255024, -0.27522034,  0.03785528,  0.01067257])

In [36]:
# given the growth rate:  x * (1 + g) ** t
10 * (1 + .045) ** 10

15.52969421732896

In [37]:
invested = make_array(10,11,15,20,25)
money_in_ten_years = invested * (1 + .045) ** 10
money_in_ten_years

array([15.52969422, 17.08266364, 23.29454133, 31.05938843, 38.82423554])